InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ШтрихкодированиеНоменклатурыЕГАИСКлиентПереопределяемый/Ext/Module.bsl
//#Область ПрограммныйИнтерфейс

// В процедуре нужно реализовать очистку кэшированных штрихкодов для исключения повторной обработки.
//
// Параметры:
//  ДанныеШтрихкодов - Массив - полученные штрихкоды,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
//
Процедура ОчиститьКэшированныеШтрихкоды(ДанныеШтрихкодов, КэшированныеЗначения) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// В функции нужно реализовать подготовку данных для дальнейшей обработки штрихкодов.
//
// Параметры:
//  Форма - УправляемаяФорма - форма документа, в которой происходит обработка,
//  ДанныеШтрихкодов - Массив - полученные штрихкоды,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ,
//  ПараметрыЗаполнения - Структура - параметры заполнения (см. СобытияФормЕГАИСКлиент.СтруктураПараметрыЗаполнения()).
//
// Возвращаемое значение:
//  Структура - подготовленные данные.
//
Функция ПодготовитьДанныеДляОбработкиШтрихкодов(Форма, ДанныеШтрихкодов, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается после обработки штрихкодов. В процедуре нужно проанализировать полученные штрихкоды на предмет сканирования акцизной марки, а также
// обработать штрихкоды, не привязанные к номенклатуре.
//
// Параметры:
//  Форма - УправляемаяФорма - форма документа, в которой были обработаны штрихкоды,
//  ОбработанныеДанные - Структура - подготовленные ранее данные штрихкодов,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
//
Процедура ПослеОбработкиШтрихкодов(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// В функции нужно реализовать подготовку данных для дальнейшей обработки штрихкодов, полученных из ТСД.
//
// Параметры:
//  Форма - УправляемаяФорма - форма документа, в которой происходит обработка,
//  ТаблицаТоваров - Массив - полученные данные из ТСД,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ,
//  ПараметрыЗаполнения - Структура - параметры заполнения (см. СобытияФормЕГАИСКлиент.СтруктураПараметрыЗаполнения()).
//
// Возвращаемое значение:
//  Структура - подготовленные данные.
//
Функция ПодготовитьДанныеДляОбработкиТаблицыТоваровПолученнойИзТСД(Форма, ТаблицаТоваров, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается после загрузки данных из ТСД. В процедуре нужно проанализировать полученные штрихкоды на предмет сканирования акцизной марки, а также
// обработать штрихкоды, не привязанные к номенклатуре.
//
// Параметры:
//  Форма - УправляемаяФорма - форма документа, в которой были обработаны штрихкоды,
//  ОбработанныеДанные - Структура - подготовленные ранее данные штрихкодов,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
//
Процедура ПослеОбработкиТаблицыТоваровПолученнойИзТСД(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// В процедуре нужно показать диалоговое окно для ввода штрихкода и передать полученные данные в описание оповещения.
//
// Параметры:
//  Оповещение - ОписаниеОповещения - процедура, которую нужно вызвать после ввода штрихкода.
//
Процедура ПоказатьВводШтрихкода(Оповещение = Неопределено) Экспорт
	
	Результат = "";
	Если ШтрихкодыНоменклатурыКлиент.ВвестиШтрихкод(Результат) И
		НЕ (Оповещение = Неопределено) Тогда
		
		ВыполнитьОбработкуОповещенияЕГАИС(Оповещение, Новый Структура("Штрихкод,Количество",Результат,1));
		
	КонецЕсли;
	
КонецПроцедуры

// В процедуре нужно открыть форму регистрации новых штрихкодов номенклатуры.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, откуда производится вызов процедуры,
//  ДанныеШтрихкодов - Массив - элемент массива - структура с ключами:
//   * Штрихкод - Строка - штрихкод номенклатуры,
//   * Количество - Число - количество алкогольной продукции.
//
Процедура ОткрытьФормуРегистрацииШтрихкодовНоменклатуры(Форма, ДанныеШтрихкодов) Экспорт
	
	//++ НЕ ГОСИС	
	Если ДанныеШтрихкодов.Количество() > 0 Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("ШтрихКод", ДанныеШтрихкодов[0].ШтрихКод);
		ПараметрыОткрытияФормы.Вставить("ТипШтрихкода", ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13);
		
		ОткрытьФормуЕГАИС(
			"РегистрСведений.Штрихкоды.Форма.ФормаЗаписиУправляемая",
			ПараметрыОткрытияФормы,
			Форма,
			Новый УникальныйИдентификатор,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	//-- НЕ ГОСИС
	
КонецПроцедуры

//#КонецОбласти
